let element= document.getElementById(`s1`)

function main() {
    let sorat= ['اللہ اکبر','الفاتحہ ',' البقرہ ',' آل عمران',
                ' النساء',' المائدہ',' الأنعام',' الأعراف',' الأنفال',
                ' التوبہ',' یونس',' ہود',' یوسف',' مریم',' الرعد',
                 ' ابراہیم',' الحجر',' النحل',' الإسراء','الکہف','طہ',
                 'الانبیاء','الحج','المؤمنون','النور','الفرقان',
                    'الشعراء','النمل','القصص','العنکبوت','الروم',
                 'لقمان','السجدہ','الأحزاب','سبا','فاطر','یٰس',
                 'الصافات','ص','الزمر','غافر','فصلت','الشوریٰ','الزخرف',
                'الدخان','الجاثیہ','الاحقاف',' الفتح ','محمد','الحجرات',
                'ق','الذاریات','الطور','النجم','القمر','الرحمن','الواقعہ',
                'الحدید','المجادلہ','الحشر','الممتحنہ','الصف','الجمعہ',
                   'المنافقون','التغابن','الطلاق','التحریم','الملک',
                'القلم','الحاقہ','المعارج','نوح','الجن','المزمل','المدثر',
                'القیامہ','الدھر','المرسلات','النبا','النازعات','عبس',
                'التکویر','الانفطار','المطففین','الانشقاق','البروج',
                    'الطارق','الأعلى','الغاشیہ','الفجر','البلد',
                'الشمس','اللیل','الضحیٰ','الشرح','التین','العلق','القدر',
                'البینہ','الزلزلہ','العادیات','القارعہ','التکاثر','العصر',
                'الہمزہ','الفیل','قریش','الماعون','الکوثر','الکافرون','النصر',
                    'اللہب','الإخلاص','الفلق','الناس'
    ];
    let input= document.getElementById(`input`).value;
            element.innerHTML=" سورۃ  " +" (  "+
    sorat[input]+" ) " + "قرآن پاک کی " + input+ "نمبر سورت ہے۔";
          
    if (input> 114) {
        element.innerHTML='محترم ! قرآن پاک میں کل 114 سورتیں ہیں ،انہی میں تلاش کریں۔ شکریہ ';
}

}
    


        let element1 = document.getElementById(`s1`)

function main1() {

        element1.innerHTML='';

    let sorat1= ['اللہ اکبر','الفاتحہ','البقرہ','آل عمران',
                'النساء','المائدہ','الأنعام','الأعراف','الأنفال',
                'التوبہ','یونس','ہود','یوسف','مریم','الرعد',
                'ابراہیم','الحجر','النحل','الإسراء','الکہف','طہ',
                 'الانبیاء','الحج','المؤمنون','النور','الفرقان',
                    'الشعراء','النمل','القصص','العنکبوت','الروم',
                 'لقمان','السجدہ','الأحزاب','سبا','فاطر','یٰس',
                 'الصافات','ص','الزمر','غافر','فصلت','الشوریٰ','الزخرف',
                'الدخان','الجاثیہ','الاحقاف','محمد','الفتح','الحجرات',
                'ق','الذاریات','الطور','النجم','القمر','الرحمن','الواقعہ',
                'الحدید','المجادلہ','الحشر','الممتحنہ','الصف','الجمعہ',
                   'المنافقون','التغابن','الطلاق','التحریم','الملک',
                'القلم','الحاقہ','المعارج','نوح','الجن','المزمل','المدثر',
                'القیامہ','الانسان','المرسلات','النبا','النازعات','عبس',
                'التکویر','الانفطار','المطففین','الانشقاق','البروج',
                    'الطارق','الأعلى','الغاشیہ','الفجر','البلد',
                'الشمس','اللیل','الضحیٰ','الشرح','التین','العلق','القدر',
                'البینہ','الزلزلہ','العادیات','القارعہ','التکاثر','العصر',
                'الہمزہ','الفیل','قریش','الماعون','الکوثر','الکافرون','النصر',
                    'اللہب','الإخلاص','الفلق','الناس'
    ];
        for (let index2 = 0; index2 < sorat1.length; index2++) {
            
            element1.innerHTML +=sorat1[index2]+ '<br>'  
        }
           

}
         
           
             
             